results/data/run5/jvm-static/erik-laptop/quarkus-worker-pool-20000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.624ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.773ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.753ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.424ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64ms  812.84us   5.10ms   66.49%
    Req/Sec     5.28k   778.46     8.33k    83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.48ms
 75.000%    2.16ms
 90.000%    2.87ms
 99.000%    3.68ms
 99.900%    4.08ms
 99.990%    4.45ms
 99.999%    4.91ms
100.000%    5.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.221     0.000000            1         1.00
       0.703     0.100000       100129         1.11
       0.894     0.200000       199511         1.25
       1.073     0.300000       299705         1.43
       1.261     0.400000       399052         1.67
       1.481     0.500000       498854         2.00
       1.607     0.550000       548901         2.22
       1.736     0.600000       598669         2.50
       1.870     0.650000       648375         2.86
       2.012     0.700000       698426         3.33
       2.163     0.750000       748614         4.00
       2.243     0.775000       773535         4.44
       2.333     0.800000       798140         5.00
       2.445     0.825000       823262         5.71
       2.579     0.850000       847982         6.67
       2.719     0.875000       872928         8.00
       2.791     0.887500       885348         8.89
       2.867     0.900000       897754        10.00
       2.943     0.912500       910286        11.43
       3.025     0.925000       922884        13.33
       3.111     0.937500       935405        16.00
       3.159     0.943750       941474        17.78
       3.209     0.950000       947794        20.00
       3.265     0.956250       953961        22.86
       3.325     0.962500       960240        26.67
       3.387     0.968750       966431        32.00
       3.421     0.971875       969559        35.56
       3.455     0.975000       972559        40.00
       3.495     0.978125       975814        45.71
       3.535     0.981250       978836        53.33
       3.581     0.984375       981992        64.00
       3.605     0.985938       983512        71.11
       3.631     0.987500       985074        80.00
       3.661     0.989062       986690        91.43
       3.695     0.990625       988221       106.67
       3.733     0.992188       989707       128.00
       3.755     0.992969       990489       142.22
       3.777     0.993750       991266       160.00
       3.801     0.994531       992037       182.86
       3.829     0.995313       992852       213.33
       3.861     0.996094       993624       256.00
       3.879     0.996484       994025       284.44
       3.897     0.996875       994399       320.00
       3.919     0.997266       994784       365.71
       3.945     0.997656       995175       426.67
       3.977     0.998047       995569       512.00
       3.993     0.998242       995754       568.89
       4.011     0.998437       995932       640.00
       4.033     0.998633       996143       731.43
       4.055     0.998828       996325       853.33
       4.081     0.999023       996518      1024.00
       4.099     0.999121       996624      1137.78
       4.119     0.999219       996716      1280.00
       4.139     0.999316       996817      1462.86
       4.163     0.999414       996910      1706.67
       4.195     0.999512       997009      2048.00
       4.211     0.999561       997065      2275.56
       4.227     0.999609       997105      2560.00
       4.255     0.999658       997153      2925.71
       4.275     0.999707       997201      3413.33
       4.311     0.999756       997249      4096.00
       4.327     0.999780       997272      4551.11
       4.355     0.999805       997297      5120.00
       4.371     0.999829       997322      5851.43
       4.387     0.999854       997346      6826.67
       4.411     0.999878       997369      8192.00
       4.431     0.999890       997381      9102.22
       4.451     0.999902       997394     10240.00
       4.491     0.999915       997409     11702.86
       4.511     0.999927       997417     13653.33
       4.539     0.999939       997432     16384.00
       4.551     0.999945       997436     18204.44
       4.571     0.999951       997442     20480.00
       4.595     0.999957       997448     23405.71
       4.619     0.999963       997454     27306.67
       4.675     0.999969       997460     32768.00
       4.687     0.999973       997463     36408.89
       4.723     0.999976       997466     40960.00
       4.779     0.999979       997469     46811.43
       4.815     0.999982       997472     54613.33
       4.835     0.999985       997475     65536.00
       4.871     0.999986       997477     72817.78
       4.891     0.999988       997478     81920.00
       4.907     0.999989       997480     93622.86
       4.919     0.999991       997481    109226.67
       4.947     0.999992       997483    131072.00
       4.955     0.999993       997484    145635.56
       4.955     0.999994       997484    163840.00
       4.963     0.999995       997485    187245.71
       4.975     0.999995       997486    218453.33
       4.991     0.999996       997487    262144.00
       4.991     0.999997       997487    291271.11
       4.991     0.999997       997487    327680.00
       4.999     0.999997       997488    374491.43
       4.999     0.999998       997488    436906.67
       5.091     0.999998       997489    524288.00
       5.091     0.999998       997489    582542.22
       5.091     0.999998       997489    655360.00
       5.091     0.999999       997489    748982.86
       5.091     0.999999       997489    873813.33
       5.107     0.999999       997490   1048576.00
       5.107     1.000000       997490          inf
#[Mean    =        1.638, StdDeviation   =        0.813]
#[Max     =        5.104, Total count    =       997490]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1198809 requests in 1.00m, 99.46MB read
Requests/sec:  19979.57
Transfer/sec:      1.66MB