results/data/run5/jvm-static/erik-laptop/quarkus-worker-pool-60000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 22.127ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 21.967ms, rate sampling interval: 87ms
  Thread calibration: mean lat.: 21.629ms, rate sampling interval: 87ms
  Thread calibration: mean lat.: 22.054ms, rate sampling interval: 88ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.17ms   16.51ms 103.10ms   56.41%
    Req/Sec    15.10k     2.46k   20.81k    68.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.90ms
 75.000%   37.02ms
 90.000%   45.31ms
 99.000%   56.51ms
 99.900%   75.20ms
 99.990%   89.92ms
 99.999%  100.10ms
100.000%  103.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.135     0.000000            1         1.00
       1.223     0.100000       299757         1.11
       4.191     0.200000       598820         1.25
      10.887     0.300000       898476         1.43
      17.007     0.400000      1197937         1.67
      22.895     0.500000      1497282         2.00
      25.775     0.550000      1646800         2.22
      28.639     0.600000      1797040         2.50
      31.471     0.650000      1946854         2.86
      34.271     0.700000      2096838         3.33
      37.023     0.750000      2246772         4.00
      38.367     0.775000      2320576         4.44
      39.743     0.800000      2396726         5.00
      41.087     0.825000      2471601         5.71
      42.431     0.850000      2546085         6.67
      43.807     0.875000      2620271         8.00
      44.543     0.887500      2657922         8.89
      45.311     0.900000      2695010        10.00
      46.143     0.912500      2733320        11.43
      47.007     0.925000      2770205        13.33
      47.967     0.937500      2808095        16.00
      48.479     0.943750      2826617        17.78
      49.023     0.950000      2845144        20.00
      49.599     0.956250      2863292        22.86
      50.271     0.962500      2881953        26.67
      51.039     0.968750      2901071        32.00
      51.455     0.971875      2910018        35.56
      51.935     0.975000      2919449        40.00
      52.479     0.978125      2928679        45.71
      53.151     0.981250      2938083        53.33
      53.983     0.984375      2947398        64.00
      54.527     0.985938      2952153        71.11
      55.167     0.987500      2956820        80.00
      55.935     0.989062      2961352        91.43
      56.959     0.990625      2966096       106.67
      58.239     0.992188      2970693       128.00
      59.071     0.992969      2973056       142.22
      60.031     0.993750      2975389       160.00
      61.119     0.994531      2977667       182.86
      62.495     0.995313      2980046       213.33
      64.095     0.996094      2982370       256.00
      65.055     0.996484      2983549       284.44
      66.047     0.996875      2984701       320.00
      67.199     0.997266      2985895       365.71
      68.415     0.997656      2987067       426.67
      69.823     0.998047      2988200       512.00
      70.655     0.998242      2988796       568.89
      71.615     0.998437      2989371       640.00
      72.703     0.998633      2989952       731.43
      73.919     0.998828      2990540       853.33
      75.391     0.999023      2991120      1024.00
      76.159     0.999121      2991408      1137.78
      77.055     0.999219      2991706      1280.00
      77.951     0.999316      2991995      1462.86
      79.039     0.999414      2992289      1706.67
      80.255     0.999512      2992584      2048.00
      80.959     0.999561      2992727      2275.56
      81.727     0.999609      2992874      2560.00
      82.559     0.999658      2993020      2925.71
      83.391     0.999707      2993172      3413.33
      84.287     0.999756      2993311      4096.00
      84.927     0.999780      2993388      4551.11
      85.567     0.999805      2993459      5120.00
      86.399     0.999829      2993530      5851.43
      87.295     0.999854      2993603      6826.67
      88.511     0.999878      2993675      8192.00
      89.151     0.999890      2993711      9102.22
      90.047     0.999902      2993748     10240.00
      91.071     0.999915      2993784     11702.86
      92.223     0.999927      2993821     13653.33
      93.375     0.999939      2993858     16384.00
      94.015     0.999945      2993875     18204.44
      94.655     0.999951      2993893     20480.00
      95.423     0.999957      2993912     23405.71
      95.999     0.999963      2993930     27306.67
      96.767     0.999969      2993948     32768.00
      97.407     0.999973      2993958     36408.89
      97.663     0.999976      2993967     40960.00
      98.367     0.999979      2993976     46811.43
      98.559     0.999982      2993985     54613.33
      99.263     0.999985      2993994     65536.00
      99.391     0.999986      2994000     72817.78
      99.903     0.999988      2994003     81920.00
     100.095     0.999989      2994010     93622.86
     100.159     0.999991      2994012    109226.67
     100.671     0.999992      2994018    131072.00
     100.799     0.999993      2994019    145635.56
     100.863     0.999994      2994022    163840.00
     100.927     0.999995      2994024    187245.71
     101.247     0.999995      2994027    218453.33
     101.439     0.999996      2994028    262144.00
     101.503     0.999997      2994029    291271.11
     101.759     0.999997      2994030    327680.00
     101.951     0.999997      2994033    374491.43
     101.951     0.999998      2994033    436906.67
     102.015     0.999998      2994034    524288.00
     102.015     0.999998      2994034    582542.22
     102.335     0.999998      2994035    655360.00
     102.655     0.999999      2994036    748982.86
     102.655     0.999999      2994036    873813.33
     102.719     0.999999      2994037   1048576.00
     102.719     0.999999      2994037   1165084.44
     102.719     0.999999      2994037   1310720.00
     103.103     0.999999      2994038   1497965.71
     103.103     0.999999      2994038   1747626.67
     103.103     1.000000      2994038   2097152.00
     103.103     1.000000      2994038   2330168.89
     103.103     1.000000      2994038   2621440.00
     103.167     1.000000      2994039   2995931.43
     103.167     1.000000      2994039          inf
#[Mean    =       23.166, StdDeviation   =       16.512]
#[Max     =      103.104, Total count    =      2994039]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3595252 requests in 1.00m, 298.30MB read
Requests/sec:  59901.25
Transfer/sec:      4.97MB